INSERT INTO mealkit (mealkit_id, mealkit_name, mealkit_photo, mealkit_price, mealkit_ingredient, mealkit_calories, mealkit_order_count, mealkit_stock, mealkit_created_at, mealkit_updated_at, mealkit_deleted_at, admin_id, mealkit_status)
VALUES
(NULL, '밀웜씨리얼밀키트', '그림1', 5900, '밀웜, 오트밀, 꿀', 300, 150, 1, '2019-02-17 12:20:50', NULL, NULL, 2, '판매중'),
(NULL, '마라탕후루정식밀키트', '그림2', 11000, '마라소스, 돼지고기, 당근, 양파, 탕후루', 450, 120, 30, '2019-07-26 15:20:15', NULL, NULL, 2, '판매중'),
(NULL, '달팽이쫄면밀키트', '그림3', 8000, '달팽이, 쫄면, 양념장', 380, 50, 16, '2019-11-03 12:10:13', NULL, NULL, 2, '판매중'),
(NULL, '장수풍뎅이리조또밀키트', '그림4', 9200, '장수풍뎅이, 쌀, 양파, 파, 당근, 치즈', 272, 18, 70, '2020-01-28 13:20:15', NULL, NULL, 2, '판매중'),
(NULL, '귀뚜라미채소덮밥밀키트', '그림5', 10400, '귀뚜라미, 쌀, 야채, 양념', 210, 20, 30, '2020-07-06 15:20:15', NULL, NULL, 2, '판매중'),
(NULL, '곰팡이 스튜 밀키트', '그림6', 9900, '곰팡이, 당근, 양파,쪽파, 고기, 소스', 420, 13, 20, '2020-12-01 12:11:00', NULL, '2021-01-10 11:11:00', 4, '삭제'),
(NULL, '오징어 껍질 샐러드 밀키트', '그림7', 11000, '오징어 껍질, 쪽파, 대파, 양파, 발사믹드레싱', 360, 78, 34, '2020-12-01 13:11:00', NULL, NULL, 4, '판매중'),
(NULL, '고추 가득 꽁치 피자 밀키트', '그림8', 8900, '꽁치, 고추, 치즈, 도우, 토마토소스', 284, 98, 0, '2021-02-26 13:02:15', NULL, NULL, 2, '품절'),
(NULL, '녹차 닭발 밀키트', '그림9', 8900, '녹차, 닭발, 닭발 소스', 400, 14, 69, '2021-04-05 15:11:00', NULL, NULL, 4, '판매중'),
(NULL, '땅콩 치즈 라면 밀키트', '그림10', 4500, '땅콩, 라면, 치즈, 스프', 280, 200, 51, '2021-08-12 12:45:10', NULL, NULL, 1, '판매중'),
(NULL, '장수풍뎅이 라자냐 밀키트', '그림11', 9900, '장수풍뎅이, 라자냐, 라자냐 소스, 치즈', 397, 110, 44, '2021-08-13 15:43:50', NULL, NULL, 1, '판매중'),
(NULL, '닭머리 죽밥 밀키트', '그림12', 7000, '닭머리, 쌀, 당근, 고추', 320, 45, 20, '2022-02-01 08:11:00', NULL, NULL, 1, '판매중'),
(NULL, '황소 매운탕 밀키트', '그림13', 10000, '황소고기, 매운탕 양념, 당근, 양배추', 425, 23, 12, '2022-06-21 15:05:00', NULL, NULL, 1, '판매중'),
(NULL, '마시멜로 물회 밀키트', '그림14', 11000, '마시멜로, 물회소스, 양배추, 소면, 광어회, 우럭회, 오징어회, 소라', 410, 59, 7, '2022-07-01 12:01:00', NULL, NULL, 4, '판매중'),
(NULL, '싱싱한 지네 스파게티 밀키트', '그림15', 9000, '스파게티 소스, 지네, 스파게티 면', 350, 7, 21, '2022-07-26 13:18:15', NULL, NULL, 2, '판매중'),
(NULL, '두꺼비간장덮밥 밀키트', '그림16', 8000, '두꺼비, 쌀, 간장, 당근, 양파', 432, 120, 2, '2022-09-28 13:20:15', NULL, NULL, 3, '판매중'),
(NULL, '복숭아 해물 찌개 밀키트', '그림17', 11000, '복숭아, 오징어, 전복, 새우, 홍합, 찌개 양념', 380, 22, 0, '2022-11-26 15:01:31', NULL, NULL, 3, '품절'),
(NULL, '마늘 바나나 볶음밥 밀키트', '그림18', 9000, '마늘, 바나나, 쌀, 굴소스', 370, 43, 3, '2022-12-01 17:01:29', '2022-12-01 20:01:29', NULL, 3, '수정'),
(NULL, '오렌지 캐러멜 칠리 찌개 밀키트', '그림19', 10000, '오렌지, 캐러멜, 칠리소스, 찌개 양념', 405, 55, 2, '2022-12-25 16:20:15', NULL, NULL, 3, '판매중'),
(NULL, '고등어 크림 짜장면 밀키트', '그림20', 6000, '고등어, 짜장 소스, 면, 생크림', 320, 76, 12, '2023-03-26 15:20:15', NULL, NULL, 5, '판매중'),
(NULL, '번데기 떡갈비 밀키트', '그림21', 8900, '번데기, 다진 고기, 떡', 330, 99, 10, '2023-03-26 18:20:15', NULL, NULL, 2, '판매중'),
(NULL, '돈벌레 볶음면 밀키트', '그림22', 6400, '돈벌레, 면, 양파, 당근, 대파, 양념', 350, 100, 4, '2023-03-28 17:21:30', NULL, NULL, 1, '판매중'),
(NULL, '아홀로틀 구이 밀키트', '그림23', 10500, '아홀로틀, 간장', 314, 102, 20, '2023-05-16 15:20:15', NULL, NULL, 5, '판매중'),
(NULL, '3분 쿼리 밀키트', '그림24', 23100, '카레, 쌀, 마법소스', 348, 121, 11, '2023-06-29 14:05:14', NULL, NULL, 4, '판매중'),
(NULL, '오렌지 떡볶이 밀키트', '그림25', 6700, '오렌지, 떡, 떡볶이 양념', 342, 210, 30, '2023-07-03 12:20:15', NULL, NULL, 5, '판매중'),
(NULL, '장수풍뎅이 스시 밀키트', '그림26', 12300, '장수풍뎅이, 쌀, 와사비, 간장', 451, 340, 24, '2023-08-02 15:20:15', NULL, NULL, 5, '판매중'),
(NULL, '타이어 버블티 밀키트', '그림27', 4000, '타이어, 밀크티', 342, 4, 13, '2024-01-01 13:20:15', NULL, '2024-02-01 13:20:15', 3, '삭제'),
(NULL, '민트 초코 케밥 밀키트', '그림28', 9900, '민트초코, 또띠아, 파프리카', 340, 21, 5, '2024-01-26 11:20:15', NULL, NULL, 5, '판매중'),
(NULL, '생선잼 볶음밥 밀키트', '그림29', 7800, '생선잼, 볶음밥', 362, 5, 0, '2024-03-06 15:31:45', NULL, NULL, 5, '품절'),
(NULL, '초코 메뚜기 불고기 밀키트', '그림30', 12500, '초코, 메뚜기, 불고기', 441, 9, 3, '2024-04-28 17:02:32', NULL, NULL, 3, '판매중');

SELECT * FROM mealkit ;

INSERT INTO user_review (review_content, review_created_date, review_updated_at, review_scope, user_id,mealkit_id)
VALUES
('신선하고 고소한 밀웜이 오트밀과 환상적인 조화를 이루는 시리얼 밀키트입니다. 아침 식사로 딱이에요!', '2019-02-20 14:20:50', NULL, 4, 5, 1),
('와 탕후루가 진짜 대박이에요!!! 설탕 엄청 얇게 잘 코팅되어있어요 굿굿 마라탕은 당연히 맛있쬬', '2019-08-01 11:20:15', NULL, 5, 10, 2),
('달팽이 쫄면이 이렇게 쫄깃쫄깃하다니 믿을 수 없어요 또 시켜 먹고 싶어요', '2019-11-30 14:20:13', NULL, 4, 14, 3),
('장수풍뎅이랑 치즈의 조합이라니!! 그 누가 상상했겠어요 아묻따 별점 5점입니다', '2020-02-26 16:20:15', NULL, 5, 17, 4),
('귀뚜라미의 고소한 맛과 신선한 채소가 어우러져 건강한 한 끼 식사가 되는 덮밥 밀키트예요 요즘 시간은 없지만 건강은 챙기고픈 분께 강추예요', '2020-07-06 15:20:15', NULL, 4, 30, 5),
('곰팡이가 음식의 재료가 될줄은 상상도 못했는데 의외로 별미긴한데...흠.........', '2021-01-01 12:11:00', NULL, 1, 9, 6),
('오징어 껍질이 오징어 살보다 맛있는데요?', '2021-01-03 13:11:00', '2021-01-03 13:15:00', 4, 12, 7),
('기대하면서 시킨건데 뭔가 피자랑 꽁치는 안어울리는 느낌이긴하네요 ㅠㅠ 하지만 못먹을 정도는 아니에요', '2021-03-11 13:02:15', NULL, 3, 24, 8),
('녹차도 좋아하고 닭발도 좋아하는데 같이 먹을 수 있으면 완전 럭키비키자낭~!!!!', '2021-04-06 15:11:00', NULL, 4, 20, 9),
('땅콩...과 치즈는 좀 제스타일이아니긴 하네여.... 하지만 직접 돈주고 시킨거니 먹어야겠죠?', '2021-08-17 12:45:10', NULL, 2, 21, 10),
('제가 장수풍뎅이를 진짜 좋아하는데요 왜냐면 장수풍뎅이 식감이 진짜 좋거든요 그래서 장풍리도 시켜먹었는데 장풍라도 최고였어요', '2021-08-15 15:43:50', NULL, 5, 17, 11),
('몸이 안좋아서 죽 밀키트를 좀 시켜놨는데 시킨것중에 이게 제일 무난하니 맛있네요', '2022-02-11 08:11:00', NULL, 4, 23, 12),
('엄청매워요!!! 맵찔이는 조심해야해요 하지만 저는 맵짱이라 맛있게 먹었슴당 ㅎㅎㅎ', '2022-06-27 15:05:00', NULL, 4, 29, 13),
('물회에 마시멜로가 들어가니까 약간 옹심이 같기도하고 맛있어요 달달~하니 좋습니다', '2022-07-09 12:01:00', NULL, 4, 16, 14),
('지네 스파게티 너무 맛있어요 제가 이탈리아 유학생인데 거기 미슐랭 파이브스타 집 보다 맛있어요', '2022-07-30 15:18:15', NULL, 5, 15, 15),
('개인적으로는 다른 곳에서 파는 개구리간장덮밥이 더 먹을만 했던거같아요....두꺼비는 좀 질기네요....', '2022-10-02 12:10:15', NULL, 2, 7, 16),
('배송이 너무 늦게 왔어요ㅡㅡ 맛까지 없었으면 진짜 별점 1점 줬을지도몰라요!!!!', '2022-12-20 15:01:31', NULL, 3, 4, 17),
('마늘의 매운 맛을 바나나의 단 맛이 잡아줘서 금상첨화예요', '2022-12-10 17:01:29', NULL, 5, 2, 18),
('와 진짜 독특해요 오렌지랑 캐러멜도 독특한데 거기에 칠리까지? 약간 말로 표현할 수 없는 맛이지만 독특하다는 점에서 점수 드릴게요', '2023-01-09 16:20:15', NULL, 4, 21, 19),
('배송은 어제 왔는데 경비아저씨가 배달왔다고 했는데 만우절이라 뻥인줄알고 안찾아갔어요 근데 이거 진짜 맛있네요 하루 빨리 못먹은게 아쉬울정도예요', '2023-04-02 15:20:15', NULL, 5, 15, 20),
('번데기의 고소함과 떡갈비의 감칠맛이 어우러져 색다른 맛을 느낄 수 있어요', '2023-04-03 18:20:15', NULL, 4, 17, 21),
('가입하고 처음 시키는 밀키트인데 기대 이상이에요 ㅎㅎ 자주 시켜먹겠습니다', '2023-04-10 17:21:30', NULL, 4, 18, 22),
('아홀로틀의 부드러움과 양념이 조화를 이루네요 하지만 두번은 안시켜먹을듯', '2023-05-20 15:20:15', NULL, 3, 11, 23),
('밀키트 카레가 이렇게 맛있으면 인도는 어떡하라고요. 이름에서부터 긍정적인 기운이 느껴져서 입에넣자마자 눈물이 났어요', '2023-07-03 14:05:14', NULL, 5, 26, 24),
('오렌지는 상큼하고 떡볶이는 매콤하고...이맛도 저맛도아닌 느낌이에요', '2023-07-11 12:20:15', NULL, 2, 6, 25),
('장수풍뎅이리조또 장수풍뎅이라자냐 다 시켜먹어본 장수풍뎅이 마니아입니다. 이건 좀 실망스럽네요. 장수풍뎅이가 맛없을 수 있다는 걸 이번 밀키트를 통해 처음 알게되었습니다.', '2023-08-10 15:20:15', '2023-08-10 15:25:15', 2, 17, 26),
('타이어 밀크티라니ㅋㅋ 타이어의 쫄깃함에 턱이 나갔어요 턱강화 원하시는 분들 강추 ><', '2024-01-16 13:20:15', NULL, 4, 8, 27),
('민트초코러버는 안시켜먹을 수 없는 음식이에용!', '2024-02-02 11:20:15', NULL, 5, 20, 28),
('무난히 맛있었어요 생선잼을 볶음밥 말고 빵이랑 먹어도 맛있을거같아요! 응용도 가능한 밀키트!', '2024-03-16 15:31:45', NULL, 3, 27, 29),
('메뚜기가 초코랑 만나니까 세상에 없던 맛이에요', '2024-05-02 17:02:32', NULL, 2, 26, 30);


SELECT * FROM user_review ;

SELECT * FROM ADMIN;
SELECT * FROM mealkit ;
DESC ADMIN;
DESC mealkit;
DESC user_review;
SELECT * FROM user_review ;

